---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom
source: html/fe6c82c4-5816-e1b3-aa91-24ab2ad86c33.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom Property

"Supply From"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecDistributionNodeSupplyFrom { get; }
```